{
    "pl": {
        "translation": {
            "About me": "O mnie",
            "Contact": "Kontakt",
            "I'm a thriving frontend developer": "Jestem prosperujcym frontend developerem",
            "Facts about me": "Fakty o mnie",
            "Username": "Nazwa u偶ytkownika",
            "Fiji404 or Radek :D": "Fiji404 lub Radek :D",
            "Description": "Opis",
            "I am an nineteen year old boy from Poland who is interested in programming. I have been fascinated by technology and the way the internet works from a young age. Soon, I began to learn the ins and outs of programming, and I am currently developing my skills in this area. My passion is developing web applications and improving their functionality. I always try to learn new technologies and tools to create better and more innovative solutions. I want to develop my programming skills to work as a programmer in the future and contribute to the development of the IT industry.": "Jestem osiemnastoletnim chopakiem z Polski zainteresowanym programowaniem. Od modego wieku fascynowaa mnie technologia i spos贸b, w jaki dziaa internet. Wkr贸tce zaczem uczy si programowania i obecnie rozwijam swoje umiejtnoci w tej dziedzinie. Moja pasja to tworzenie aplikacji internetowych i ulepszanie ich funkcjonalnoci. Zawsze staram si uczy nowych technologii i narzdzi, aby tworzy lepsze i bardziej innowacyjne rozwizania. Chc rozwija swoje umiejtnoci programowania, aby w przyszoci m贸c pracowa jako programista i przyczyni si do rozwoju bran偶y IT.",
            "My career": "Moja kariera",
            "Flaggy is an educational app designed to test your knowledge and recognition of flags from around the world. The core objective of Flaggy is simple yet challenging: guess the flag based on the displayed image. The app offers four modes for different preferences and skill levels.": "Flaggy to edukacyjna aplikacja stworzona w celu sprawdzenia Twojej wiedzy i umiejtnoci rozpoznawania flag z r贸偶nych zaktk贸w wiata. G贸wny jej cel jest prosty, ale wymagajcy: nale偶y zgadn flag na podstawie wywietlonego obrazka na ekranie. Aplikacja oferuje cztery tryby, kt贸re odpowiadaj r贸偶nym preferencjom i poziomom umiejtnoci.",
            "This is my first application from I started learning web development. It was intended for creating and sharing valuable frontend tips by users of the platform. Users can add our own tips by doing registration. All tips is stored in public so any user can view and edit every tip.": "To jest moja pierwsza aplikacja, kt贸r stworzyem uczc si tworzenia stron internetowych. Jej celem jest tworzenie i udostpnianie wartociowych wskaz贸wek dotyczcych frontendu przez u偶ytkownik贸w platformy. U偶ytkownicy mog dodawa wasne porady po zarejestrowaniu si. Wszystkie wskaz贸wki s publiczne wic ka偶dy mo偶e je sprawdzi i edytowa.",
            "Towards the end of 2021, I embarked on the journey of creating websites. I began by selecting two fundamental languages - HTML and CSS, and acquired knowledge through online tutorials on YouTube and official documentation, implementing my learning into personal projects. Later, I advanced my skills by learning JavaScript and TypeScript through comprehensive courses on Udemy, supplemented with personal projects. I then extended my knowledge by studying SASS and TailwindCSS. Presently, I am furthering my learning on React via Udemy.": "Pod koniec 2021 roku rozpoczem swoj przygod z tworzeniem stron internetowych. Zaczem od wyboru dw贸ch podstawowych jzyk贸w - HTML i CSS, zdobywajc wiedz poprzez poradniki online na YouTube oraz dziki oficjalnej dokumentacji, wdra偶ajc swoj nauk w praktyce poprzez wasne projekty. Nastpnie poszerzyem swoje umiejtnoci poprzez nauk jzyk贸w JavaScript i TypeScript z pomoc kurs贸w na Udemy, uzupenionych o wasne projekty. P贸藕niej rozwijaem swoj wiedz poprzez nauk SASS i TailwindCSS. Obecnie kontynuuj swoj nauk na platformie Udemy, uczc si React'a.",
            "Skills": "Umiejtnoci",
            "Featured Projects": "Wyr贸偶nione projekty",
            "Contact me": "Skontaktuj si ze mn",
            "Full name": "Imi i nazwisko",
            "Subject": "Temat",
            "Hello , I'm writing you because...": "Cze , Pisz do ciebie poniewa偶...",
            "Send": "Wylij",
            "Learn more": "Zobacz wicej",
            "About this project": "O tym projekcie",
            "Our site is designed to be user-friendly, with easy-to-read articles that are packed with useful information. We cover a variety of languages, including HTML, CSS, JavaScript, and more, so you're sure to find something that interests you.One of the things that sets our website apart is our commitment to providing tips that are backed by research and proven to be effective. We carefully curate our content to ensure that everything we publish is based on sound scientific principles, so you can trust that the advice you find here is reliable and trustworthy. Whether you're a seasoned expert or a curious beginner, our website has something to offer. We believe that everyone can benefit from learning new tips and tricks, and our goal is to make that process as easy and enjoyable as possible. So why not take a look around and see what you can discover today?": "Nasza strona zostaa zaprojektowana tak, aby bya przyjazna u偶ytkownikowi, z atwymi do przeczytania artykuami, kt贸re s wypenione przydatnymi informacjami. Obejmujemy r贸偶norodne jzyki programowania, w tym HTML, CSS, JavaScript i wiele wicej, wic na pewno znajdziesz co, co Ci zainteresuje. Jedn z rzeczy, kt贸ra wyr贸偶nia nasz stron internetow, jest nasze zaanga偶owanie w dostarczanie sprawdzonych naukowo i skutecznych porad. Starannie dobieramy nasze treci, aby zapewni, 偶e wszystko, co publikujemy, oparte jest na solidnych zasadach naukowych, dziki czemu mo偶esz zaufa, 偶e znajdziesz tutaj rzetelne i wiarygodne porady. Niezale偶nie od tego, czy jeste dowiadczonym ekspertem, czy ciekawym pocztkujcym, nasza strona ma co do zaoferowania. Wierzymy, 偶e ka偶dy mo偶e skorzysta z nauki nowych trik贸w i porad, a naszym celem jest uczynienie tego procesu atwym i przyjemnym. Dlaczego wic nie rozejrzyj si i sprawd藕, co mo偶esz dzi odkry?",
            "Tech stack": "Stack technologiczny",
            "Features": "Funkcje",
            "User can add your own tips": "U偶ytkownik mo偶e dodawa wasne wskaz贸wki",
            "View and edit tip": "Mo偶liwo ogldania i edytowania wskaz贸wki",
            "Selecting between dark/light theme": "Obsuga zmiany jasnego/ciemnego motywu",
            "Player have 4 modes to play": "U偶ytkownik posiada 4 tryby gry do zagrania",
            "Welcome to Flaggy, the ultimate flag guessing game! Test your knowledge and recognition skills as you try to guess flags from all around the world. With four exciting game modes, including All Flags, Time Challenge, Random Flag, and Flag by Continent, there's never a dull moment. Enjoy the stunning visuals and race against the clock in Time Challenge mode or explore flags from specific regions in Flag by Continent. Whether you're a flag enthusiast or just looking for some casual fun, Flaggy is the app for you!": "Witaj w Flaggy, najdoskonalszej grze w zgadywanie flag! Sprawd藕 swoj wiedz i umiejtnoci rozpoznawania, pr贸bujc odgadn flagi z caego wiata. Z czterema ekscytujcymi trybami gry, w tym \"Wszystkie flagi\", \"Wyzwanie czasowe\", \"Losowa flaga\" i \"Flagi wedug kontynent贸w\", nigdy nie bdzie nudno. Ciesz si zachwycajcymi wizualizacjami, cigajc si z czasem w trybie \"Wyzwanie czasowe\" lub odkrywajc flagi z konkretnych region贸w w trybie \"Flagi wedug kontynent贸w\". Bez wzgldu na to, czy jeste mionikiem flag, czy szukasz lu藕nej zabawy, Flaggy to aplikacja stworzona dla Ciebie!",
            "Screenshots": "Zrzuty ekranu",
            "User can choose between light/dark theme": "U偶ytkownik mo偶e wybiera pomidzy jasnym/ciemnym motywem",
            "Repository": "Repozytorium",
            "Site": "Strona"
        }
    }
}
